In [1]:
#lab 2
#EXERCISE 1 : Introduction to Pandas
#DATE : 02-09-2022
#Name : Shaarav Dua
#RegNo : 230968256
#Batch : 4

In [2]:
import pandas as pd

In [3]:
#Q1. Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3.

In [4]:
data = {'Roll No':['1','2','3','4','5','6','7','8','9','10'],
        'Name':['Sithal','Ranjan','Shaaru','Varun','Rohan','Anika','Jaanki','Preetam','Kartabya','Tanuja'],
        'Gender':['Female','Male','Female','Male','Male','Female','Female','Male','Male','Female'],
        'Marks1':[61,88,89,68,55,44,29,85,100,11],
        'Marks2':[29,33,44,45,61,67,87,99,100,100],
        'Marks3':[90,47,78,23,97,72,56,73,95,56]
       }

In [5]:
df = pd.DataFrame(data)

In [6]:
df

  Roll No      Name  Gender  Marks1  Marks2  Marks3
0       1    Sithal  Female      61      29      90
1       2    Ranjan    Male      88      33      47
2       3    Shaaru  Female      89      44      78
3       4     Varun    Male      68      45      23
4       5     Rohan    Male      55      61      97
5       6     Anika  Female      44      67      72
6       7    Jaanki  Female      29      87      56
7       8   Preetam    Male      85      99      73
8       9  Kartabya    Male     100     100      95
9      10    Tanuja  Female      11     100      56

In [7]:
df

In [8]:
df

             Name  Gender  Marks1  Marks2  Marks3
Roll No
1          Sithal  Female      61      29      90
2          Ranjan    Male      88      33      47
3          Shaaru  Female      89      44      78
4           Varun    Male      68      45      23
5           Rohan    Male      55      61      97
6           Anika  Female      44      67      72
7          Jaanki  Female      29      87      56
8         Preetam    Male      85      99      73
9        Kartabya    Male     100     100      95
10         Tanuja  Female      11     100      56

In [9]:
#Q2. Create a new column with total marks

In [10]:
df['TotalMarks'] = df['Marks1'].astype(int)+df['Marks2'].astype(int)+df['Marks3'].astype(int)

In [11]:
df

             Name  Gender  Marks1  Marks2  Marks3  TotalMarks
Roll No
1          Sithal  Female      61      29      90         180
2          Ranjan    Male      88      33      47         168
3          Shaaru  Female      89      44      78         211
4           Varun    Male      68      45      23         136
5           Rohan    Male      55      61      97         213
6           Anika  Female      44      67      72         183
7          Jaanki  Female      29      87      56         172
8         Preetam    Male      85      99      73         257
9        Kartabya    Male     100     100      95         295
10         Tanuja  Female      11     100      56         167

In [12]:
#Q3. Find the lowest marks in Marks1

In [13]:
print("Lowest marks in Marks1 is =",min(df.Marks1))

Lowest marks in Marks1 is = 11

In [14]:
#Q4. Find the Highest marks in Marks2

In [15]:
print("Highest marks in Marks2 is =",max(df.Marks2))

Highest marks in Marks2 is = 100

In [16]:
#Q5. Find the average marks in Marks3

In [17]:
print("Average marks in Marks3 is =",(df.Marks3).mean())

Average marks in Marks3 is = 68.7

In [18]:
#Q6. Find student name with highest average

In [19]:
topper_student=df[df['TotalMarks']==df['TotalMarks'].max()]
print("Student with highest average is \n"+str(topper_student['Name']))

Student with highest average is
Roll No
9    Kartabya
Name: Name, dtype: object

In [20]:
#Q7. Find how many students failed in Marks2 (<40)

In [21]:
StudentsFailed = df[df['Marks2']<40]
print("Number of students failed in Marks2 is:", StudentsFailed.shape[0])

Number of students failed in Marks2 is: 2